package study;


//배열의 선언과 생성 방법
public class Array_1 {
  public static void main(String[] args) {
//    배열의 기본 형태
//    정수를 저장할 공간 5개를 생성
    int[] a = new int[5];
////////////////////////////////////////////////////////////////
//    배열 사용을 위한 조건
//    1. 배열을 선언
//      - 자료형[] 변수명(참조변수);       -> 변수 : 자료형 변수명;
//      ex> int[] aaa;
//      ex> double[] bbb;

//    2. 배열을 생성한다(변수에서는 초기화라고 부름)
//      - 참조변수명 = new 자료형[공간의 크기];
//     공간의 크기는 배열 생성 시 결정하며, 한 번 크기가 정해지면 수정 불가!
//      ex> aaa = new int[3];
//      ex> bbb = new double[5];

//   [문제] 정수를 다수 저장할 수 있는 배열 arr1 선언
//   [답]  int[] arr1;
//   [문제] arr1 배열을 정수가 5개 저장될 수 있도록 생성!
//   [답] arr1 = new int[5];
//   [문제] 문자열을 다수 저장할 수 있는 배열 arr2 선언
//   [답] String[] arr2;
//   [문제] arr2 배열을 문자열이 4개 저장될 수 있도록 생성
//   [답] arr2 = new String[4]
//   [문제] 변수를 선언, 초기화 -> 이 둘은 동시에 진행할수 있습니다.
//   [답] int aaa = 10;

//    배열의 선언 및 생성을 동시 진행
//    실수를 5개 저장할 수 있는 배열 arr3를 생성!
//    double[] arr3 = new double[5]



  }
}
